// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "零点了哈", 
        "离奔三又近一步了哈~", 
        "远在五环外的打工🐕送祝福了哈", 
        "生日快乐呀！", //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "愿你新的一岁",  // 同上...
        "早日实现旅游计划",
        "早日实现骑车自由",
        "攒钱计划超额完成",
        "天天开心！",
        "朋友常伴身边",
        "好男人绕你身边",
        "最后，最重要的是",
        "不做舔🐕 😏",
        "对自己好一点~😁",
        "好啦，就这样了，拜~",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        //"在遠方送上最近的祝福": "./imgs/1.png",
        //"願你下雨時身邊有傘": "./imgs/2.png",  
        //"願你每次跑圖都炸花": "./imgs/3.png",
        //"願你抬頭便有美麗的天空": "./imgs/4.png",
        //"願你烤的每一片土司都剛剛好": "./imgs/5.png",
        //"願你在繁星中抓住最鍾意的那顆": "./imgs/6.png",
        //"願你嘗試的美食比想像中更好吃": "./imgs/7.png",
        //"願你在換季的衣服裡發現零錢": "./imgs/8.png",
        //"願你做過的美夢都不會忘記": "./imgs/9.png",
        //"願你永遠平安喜樂美麗動人": "./imgs/10.png",

        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "点这哈😀！！",
        play: "music~",
        bannar_coming: "start~",
        balloons_flying: "继续哈😀",
        cake_fadein: "蛋糕？",
        light_candle: "点火！",
        wish_message: "Happy Birthday！",
        story: "来这看看祝福😀",
    }
};
